cmsis-svd/cmsis-svd/data/Nuvoton/NUC1263AE.svd
       <register>
          <name>SYS_GPA_MFPH</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SYS_GPA_MFPH</displayName>
          <description>GPIOA High Byte Multiple Function Control Register</description>
          <addressOffset>0x34</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PA8MFP</name>
              <description>PA.8 Multi-function Pin Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>3</name>
                    <description>SPI1_SS</description>
                    <value>03</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>4</name>
                    <description>SPI2_MOSI</description>
                    <value>04</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>7</name>
                    <description>UART1_RXD</description>
                    <value>07</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>9</name>
                    <description>BPWM0_CH3</description>
                    <value>09</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>10</name>
                    <description>I2C0_SCL</description>
                    <value>10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>13</name>
                    <description>TM3_EXT</description>
                    <value>13</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>14</name>
                    <description>DAC3_ST</description>
                    <value>14</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>15</name>
                    <description>INT4</description>
                    <value>15</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>PA9MFP</name>
              <description>PA.9 Multi-function Pin Selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>3</name>
                    <description>SPI1_CLK</description>
                    <value>03</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>4</name>
                    <description>SPI2_MISO</description>
                    <value>04</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>7</name>
                    <description>UART1_TXD</description>
                    <value>07</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>9</name>
                    <description>BPWM0_CH2</description>
                    <value>09</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>10</name>
                    <description>I2C1_SDA</description>
                    <value>10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>13</name>
                    <description>TM2_EXT</description>
                    <value>13</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>14</name>
                    <description>DAC2_ST</description>
                    <value>14</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>PA10MFP</name>
              <description>PA.10 Multi-function Pin Selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>3</name>
                    <description>SPI1_MISO</description>
                    <value>03</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>4</name>
                    <description>SPI2_CLK</description>
                    <value>04</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>7</name>
                    <description>I2C2_SDA</description>
                    <value>07</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>9</name>
                    <description>BPWM0_CH1</description>
                    <value>09</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>10</name>
                    <description>I2C1_SCL</description>
                    <value>10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>13</name>
                    <description>TM1_EXT</description>
                    <value>13</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>14</name>
                    <description>DAC0_ST</description>
                    <value>14</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>PA11MFP</name>
              <description>PA.11 Multi-function Pin Selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>3</name>
                    <description>SPI1_MOSI</description>
                    <value>03</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>4</name>
                    <description>SPI2_SS</description>
                    <value>04</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>7</name>
                    <description>I2C2_SCL</description>
                    <value>07</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>9</name>
                    <description>BPWM0_CH0</description>
                    <value>09</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>13</name>
                    <description>TM0_EXT</description>
                    <value>13</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>14</name>
                    <description>DAC1_ST</description>
                    <value>14</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SYS_GPB_MFPL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SYS_GPB_MFPL</displayName>
          <description>GPIOB Low Byte Multiple Function Control Register</description>
          <addressOffset>0x38</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PB0MFP</name>
              <description>PB.0 Multi-function Pin Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>1</name>
                    <description>ADC0_CH0, VDET_P0</description>
                    <value>01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>SPI0_SS</description>
                    <value>03</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>4</name>
                    <description>SPI2_I2SMCLK</description>
                    <value>04</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>7</name>
                    <description>UART2_RXD</description>
                    <value>07</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>8</name>
                    <description>SPI0_I2SMCLK</description>
                    <value>08</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>9</name>
                    <description>I2C1_SDA</description>
                    <value>09</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>11</name>
                    <description>BPWM2_CH5</description>
                    <value>11</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>12</name>
                    <description>BPWM3_CH5</description>
                    <value>12</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>PB1MFP</name>
              <description>PB.1 Multi-function Pin Selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>1</name>
                    <description>ADC0_CH1, VDET_P1, SPDH_HSA</description>
                    <value>01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>SPI1_I2SMCLK</description>
                    <value>02</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>7</name>
                    <description>UART2_TXD</description>
                    <value>07</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>9</name>
                    <description>I2C1_SCL</description>
                    <value>09</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>11</name>
                    <description>BPWM2_CH4</description>
                    <value>11</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>12</name>
                    <description>BPWM3_CH4</description>
                    <value>12</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>13</name>
                    <description>TM3_EXT</description>
                    <value>13</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>PB2MFP</name>
              <description>PB.2 Multi-function Pin Selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>1</name>
                    <description>ADC0_CH2, ACMP0_P0</description>
                    <value>01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>SPI1_SS</description>
                    <value>02</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>4</name>
                    <description>I2C1_SDA</description>
                    <value>04</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>6</name>
                    <description>UART1_RXD</description>
                    <value>06</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>7</name>
                    <description>I2C2_SDA</description>
                    <value>07</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>8</name>
                    <description>SPI0_I2SMCLK</description>
                    <value>08</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>11</name>
                    <description>BPWM2_CH3</description>
                    <value>11</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>14</name>
                    <description>TM3</description>
                    <value>14</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>15</name>
                    <description>INT3</description>
                    <value>15</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>PB3MFP</name>
              <description>PB.3 Multi-function Pin Selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>1</name>
                    <description>ADC0_CH3, ACMP0_P1, ACMP1_P0</description>
                    <value>01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>SPI1_CLK</description>
                    <value>02</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>4</name>
                    <description>I2C1_SCL</description>
                    <value>04</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>6</name>
                    <description>UART1_TXD</description>
                    <value>06</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>7</name>
                    <description>I2C2_SCL</description>
                    <value>07</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>11</name>
                    <description>BPWM2_CH2</description>
                    <value>11</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>14</name>
                    <description>TM2</description>
                    <value>14</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>15</name>
                    <description>INT2</description>
                    <value>15</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>PB4MFP</name>
              <description>PB.4 Multi-function Pin Selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>1</name>
                    <description>ADC0_CH4, ACMP0_N, ACMP1_P1, ACMP2_P0</description>
                    <value>01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>SPI1_MOSI</description>
                    <value>02</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>6</name>
                    <description>I2C0_SDA</description>
                    <value>06</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>11</name>
                    <description>BPWM2_CH1</description>
                    <value>11</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>12</name>
                    <description>LLSI5_OUT</description>
                    <value>12</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>13</name>
                    <description>UART2_RXD</description>
                    <value>13</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>14</name>
                    <description>TM1</description>
                    <value>14</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>15</name>
                    <description>INT1</description>
                    <value>15</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>PB5MFP</name>
              <description>PB.5 Multi-function Pin Selection</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>1</name>
                    <description>ADC0_CH5, ACMP1_N, ACMP2_P1, ACMP3_P0</description>
                    <value>01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>SPI1_MISO</description>
                    <value>02</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>6</name>
                    <description>I2C0_SCL</description>
                    <value>06</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>11</name>
                    <description>BPWM2_CH0</description>
                    <value>11</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>12</name>
                    <description>LLSI4_OUT</description>
                    <value>12</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>13</name>
                    <description>UART2_TXD</description>
                    <value>13</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>14</name>
                    <description>TM0</description>
                    <value>14</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>15</name>
                    <description>INT0</description>
                    <value>15</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>PB6MFP</name>
              <description>PB.6 Multi-function Pin Selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>1</name>
                    <description>ADC0_CH6, ACMP2_N, ACMP3_P1</description>
                    <value>01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>6</name>
                    <description>UART1_RXD</description>
                    <value>06</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>10</name>
                    <description>BPWM1_CH5</description>
                    <value>10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>12</name>
                    <description>BPWM3_CH5</description>
                    <value>12</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>13</name>
                    <description>INT4</description>
                    <value>13</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>15</name>
                    <description>ACMP1_O</description>
                    <value>15</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>PB7MFP</name>
              <description>PB.7 Multi-function Pin Selection</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>1</name>
                    <description>ADC0_CH7, ACMP3_N</description>
                    <value>01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>6</name>
                    <description>UART1_TXD</description>
                    <value>06</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>10</name>
                    <description>BPWM1_CH4</description>
                    <value>10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>12</name>
                    <description>BPWM3_CH4</description>
                    <value>12</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>13</name>
                    <description>INT5</description>
                    <value>13</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>15</name>
                    <description>ACMP0_O</description>
                    <value>15</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
