cmsis-svd/cmsis-svd/data/Nuvoton/NUC1263AE.svd
       <register>
          <name>SYS_GPB_MFPH</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SYS_GPB_MFPH</displayName>
          <description>GPIOB High Byte Multiple Function Control Register</description>
          <addressOffset>0x3C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PB8MFP</name>
              <description>PB.8 Multi-function Pin Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>1</name>
                    <description>ADC0_CH8</description>
                    <value>01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>5</name>
                    <description>UART0_RXD</description>
                    <value>05</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>6</name>
                    <description>UART1_nRTS</description>
                    <value>06</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>7</name>
                    <description>I2C1_SMBSUS</description>
                    <value>07</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>9</name>
                    <description>I2C0_SDA</description>
                    <value>09</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>10</name>
                    <description>BPWM1_CH3</description>
                    <value>10</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>PB9MFP</name>
              <description>PB.9 Multi-function Pin Selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>1</name>
                    <description>ADC0_CH9</description>
                    <value>01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>5</name>
                    <description>UART0_TXD</description>
                    <value>05</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>6</name>
                    <description>UART1_nCTS</description>
                    <value>06</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>7</name>
                    <description>I2C1_SMBAL</description>
                    <value>07</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>9</name>
                    <description>I2C0_SCL</description>
                    <value>09</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>10</name>
                    <description>BPWM1_CH2</description>
                    <value>10</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>PB10MFP</name>
              <description>PB.10 Multi-function Pin Selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>1</name>
                    <description>ADC0_CH10</description>
                    <value>01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>5</name>
                    <description>UART0_nRTS</description>
                    <value>05</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>7</name>
                    <description>I2C1_SDA</description>
                    <value>07</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>10</name>
                    <description>BPWM1_CH1</description>
                    <value>10</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>PB11MFP</name>
              <description>PB.11 Multi-function Pin Selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>1</name>
                    <description>ADC0_CH11</description>
                    <value>01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>5</name>
                    <description>UART0_nCTS</description>
                    <value>05</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>7</name>
                    <description>I2C1_SCL</description>
                    <value>07</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>9</name>
                    <description>SPI0_I2SMCLK</description>
                    <value>09</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>10</name>
                    <description>BPWM1_CH0</description>
                    <value>10</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>PB12MFP</name>
              <description>PB.12 Multi-function Pin Selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>1</name>
                    <description>ADC0_CH12, DAC0_OUT, ACMP0_P2, ACMP1_P2</description>
                    <value>01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>4</name>
                    <description>SPI0_MOSI</description>
                    <value>04</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>6</name>
                    <description>UART0_RXD</description>
                    <value>06</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>8</name>
                    <description>I2C2_SDA</description>
                    <value>08</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>10</name>
                    <description>LLSI3_OUT</description>
                    <value>10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>11</name>
                    <description>BPWM3_CH3</description>
                    <value>11</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>13</name>
                    <description>TM3_EXT</description>
                    <value>13</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>PB13MFP</name>
              <description>PB.13 Multi-function Pin Selection</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>1</name>
                    <description>ADC0_CH13, DAC1_OUT, ACMP0_P3, ACMP1_P3</description>
                    <value>01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>4</name>
                    <description>SPI0_MISO</description>
                    <value>04</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>6</name>
                    <description>UART0_TXD</description>
                    <value>06</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>8</name>
                    <description>I2C2_SCL</description>
                    <value>08</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>10</name>
                    <description>LLSI2_OUT</description>
                    <value>10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>11</name>
                    <description>BPWM3_CH2</description>
                    <value>11</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>13</name>
                    <description>TM2_EXT</description>
                    <value>13</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>PB14MFP</name>
              <description>PB.14 Multi-function Pin Selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>1</name>
                    <description>ADC0_CH14, DAC2_OUT, ACMP2_P2, ACMP3_P2</description>
                    <value>01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>4</name>
                    <description>SPI0_CLK</description>
                    <value>04</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>6</name>
                    <description>UART0_nRTS</description>
                    <value>06</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>8</name>
                    <description>I2C2_SMBSUS</description>
                    <value>08</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>10</name>
                    <description>LLSI1_OUT</description>
                    <value>10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>11</name>
                    <description>BPWM3_CH1</description>
                    <value>11</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>13</name>
                    <description>TM1_EXT</description>
                    <value>13</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>14</name>
                    <description>CLKO</description>
                    <value>14</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>PB15MFP</name>
              <description>PB.15 Multi-function Pin Selection</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>1</name>
                    <description>ADC0_CH15, DAC3_OUT, ACMP2_P3, ACMP3_P3</description>
                    <value>01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>4</name>
                    <description>SPI0_SS</description>
                    <value>04</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>6</name>
                    <description>UART0_nCTS</description>
                    <value>06</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>8</name>
                    <description>I2C2_SMBAL</description>
                    <value>08</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>10</name>
                    <description>LLSI0_OUT</description>
                    <value>10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>11</name>
                    <description>BPWM3_CH0</description>
                    <value>11</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>13</name>
                    <description>TM0_EXT</description>
                    <value>13</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
