cmsis-svd/cmsis-svd/data/Nuvoton/NUC1263AE.svd
       <register>
          <name>SYS_GPC_MFPL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SYS_GPC_MFPL</displayName>
          <description>GPIOC Low Byte Multiple Function Control Register</description>
          <addressOffset>0x40</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PC0MFP</name>
              <description>PC.0 Multi-function Pin Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>2</name>
                    <description>SPI1_SS</description>
                    <value>02</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>7</name>
                    <description>I2C1_SDA</description>
                    <value>07</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>8</name>
                    <description>UART2_RXD</description>
                    <value>08</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>9</name>
                    <description>I2C0_SDA</description>
                    <value>09</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>12</name>
                    <description>BPWM3_CH5</description>
                    <value>12</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>13</name>
                    <description>BPWM3_CH3</description>
                    <value>13</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>14</name>
                    <description>ACMP1_O</description>
                    <value>14</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>PC1MFP</name>
              <description>PC.1 Multi-function Pin Selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>2</name>
                    <description>SPI1_CLK</description>
                    <value>02</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>7</name>
                    <description>I2C1_SCL</description>
                    <value>07</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>8</name>
                    <description>UART2_TXD</description>
                    <value>08</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>9</name>
                    <description>I2C0_SCL</description>
                    <value>09</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>11</name>
                    <description>ADC0_ST</description>
                    <value>11</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>12</name>
                    <description>BPWM3_CH4</description>
                    <value>12</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>13</name>
                    <description>BPWM2_CH1</description>
                    <value>13</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>14</name>
                    <description>ACMP0_O</description>
                    <value>14</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>PC2MFP</name>
              <description>PC.2 Multi-function Pin Selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>2</name>
                    <description>SPI1_MOSI</description>
                    <value>02</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>7</name>
                    <description>I2C2_SMBSUS</description>
                    <value>07</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>8</name>
                    <description>UART2_nCTS</description>
                    <value>08</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>9</name>
                    <description>I2C0_SMBSUS</description>
                    <value>09</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>10</name>
                    <description>I2C0_SDA</description>
                    <value>10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>12</name>
                    <description>BPWM3_CH3</description>
                    <value>12</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>15</name>
                    <description>LLSI3_OUT</description>
                    <value>15</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>PC3MFP</name>
              <description>PC.3 Multi-function Pin Selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>2</name>
                    <description>SPI1_MISO</description>
                    <value>02</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>7</name>
                    <description>I2C2_SMBAL</description>
                    <value>07</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>8</name>
                    <description>UART2_nRTS</description>
                    <value>08</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>9</name>
                    <description>I2C0_SMBAL</description>
                    <value>09</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>10</name>
                    <description>I2C0_SCL</description>
                    <value>10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>12</name>
                    <description>BPWM3_CH2</description>
                    <value>12</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>15</name>
                    <description>LLSI2_OUT</description>
                    <value>15</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>PC4MFP</name>
              <description>PC.4 Multi-function Pin Selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>2</name>
                    <description>SPI1_I2SMCLK</description>
                    <value>02</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>8</name>
                    <description>UART2_RXD</description>
                    <value>08</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>9</name>
                    <description>I2C1_SDA</description>
                    <value>09</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>12</name>
                    <description>BPWM3_CH1</description>
                    <value>12</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>15</name>
                    <description>LLSI1_OUT</description>
                    <value>15</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>PC5MFP</name>
              <description>PC.5 Multi-function Pin Selection</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>8</name>
                    <description>UART2_TXD</description>
                    <value>08</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>9</name>
                    <description>I2C1_SCL</description>
                    <value>09</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>12</name>
                    <description>BPWM3_CH0</description>
                    <value>12</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>15</name>
                    <description>LLSI0_OUT</description>
                    <value>15</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>PC6MFP</name>
              <description>PC.6 Multi-function Pin Selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>4</name>
                    <description>SPI1_MOSI</description>
                    <value>04</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>7</name>
                    <description>UART0_nRTS</description>
                    <value>07</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>8</name>
                    <description>I2C1_SMBSUS</description>
                    <value>08</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>11</name>
                    <description>BPWM3_CH3</description>
                    <value>11</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>12</name>
                    <description>BPWM1_CH1</description>
                    <value>12</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>14</name>
                    <description>TM1</description>
                    <value>14</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>15</name>
                    <description>INT2</description>
                    <value>15</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>PC7MFP</name>
              <description>PC.7 Multi-function Pin Selection</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>4</name>
                    <description>SPI1_MISO</description>
                    <value>04</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>7</name>
                    <description>UART0_nCTS</description>
                    <value>07</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>8</name>
                    <description>I2C1_SMBAL</description>
                    <value>08</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>11</name>
                    <description>BPWM3_CH2</description>
                    <value>11</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>12</name>
                    <description>BPWM1_CH0</description>
                    <value>12</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>14</name>
                    <description>TM0</description>
                    <value>14</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>15</name>
                    <description>INT3</description>
                    <value>15</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SYS_GPC_MFPH</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SYS_GPC_MFPH</displayName>
          <description>GPIOC High Byte Multiple Function Control Register</description>
          <addressOffset>0x44</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PC14MFP</name>
              <description>PC14 Multi-function Pin Selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>2</name>
                    <description>SPI1_MOSI</description>
                    <value>02</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>4</name>
                    <description>SPI0_I2SMCLK</description>
                    <value>04</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>13</name>
                    <description>TM1</description>
                    <value>13</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>15</name>
                    <description>DAC1_ST</description>
                    <value>15</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SYS_GPD_MFPL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SYS_GPD_MFPL</displayName>
          <description>GPIOD Low Byte Multiple Function Control Register</description>
          <addressOffset>0x48</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PD0MFP</name>
              <description>PD.0 Multi-function Pin Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>4</name>
                    <description>SPI0_MOSI</description>
                    <value>04</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>14</name>
                    <description>TM2</description>
                    <value>14</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>PD1MFP</name>
              <description>PD.1 Multi-function Pin Selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>4</name>
                    <description>SPI0_MISO</description>
                    <value>04</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>PD2MFP</name>
              <description>PD.2 Multi-function Pin Selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>4</name>
                    <description>SPI0_CLK</description>
                    <value>04</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>9</name>
                    <description>UART0_RXD</description>
                    <value>09</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>PD3MFP</name>
              <description>PD.3 Multi-function Pin Selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>4</name>
                    <description>SPI0_SS</description>
                    <value>04</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>9</name>
                    <description>UART0_TXD</description>
                    <value>09</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SYS_GPD_MFPH</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SYS_GPD_MFPH</displayName>
          <description>GPIOD High Byte Multiple Function Control Register</description>
          <addressOffset>0x4C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PD15MFP</name>
              <description>PD.15 Multi-function Pin Selection</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>12</name>
                    <description>BPWM2_CH5</description>
                    <value>12</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>14</name>
                    <description>TM3</description>
                    <value>14</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>15</name>
                    <description>INT1</description>
                    <value>15</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
