cmsis-svd/cmsis-svd/data/Nuvoton/NUC1263AE.svd
                    <description>Px.n output with basic/higher slew rate according to HSREN[n] setting</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Px.n output with ultra higher slew rate when HSREN[n] is 1</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>UHSREN8</name>
              <description>Port A-F Pin[n] Ultra High Slew Rate Control\nNote 2: Ultra higher slew rate function is used to match I3C and SPI application when releate pins are in 1.8V domain. Both UHSREN[n] and HSREN[n] need to be set to 1.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Px.n output with basic/higher slew rate according to HSREN[n] setting</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Px.n output with ultra higher slew rate when HSREN[n] is 1</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>UHSREN9</name>
              <description>Port A-F Pin[n] Ultra High Slew Rate Control\nNote 2: Ultra higher slew rate function is used to match I3C and SPI application when releate pins are in 1.8V domain. Both UHSREN[n] and HSREN[n] need to be set to 1.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Px.n output with basic/higher slew rate according to HSREN[n] setting</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Px.n output with ultra higher slew rate when HSREN[n] is 1</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>UHSREN10</name>
              <description>Port A-F Pin[n] Ultra High Slew Rate Control\nNote 2: Ultra higher slew rate function is used to match I3C and SPI application when releate pins are in 1.8V domain. Both UHSREN[n] and HSREN[n] need to be set to 1.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Px.n output with basic/higher slew rate according to HSREN[n] setting</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Px.n output with ultra higher slew rate when HSREN[n] is 1</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>UHSREN11</name>
              <description>Port A-F Pin[n] Ultra High Slew Rate Control\nNote 2: Ultra higher slew rate function is used to match I3C and SPI application when releate pins are in 1.8V domain. Both UHSREN[n] and HSREN[n] need to be set to 1.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Px.n output with basic/higher slew rate according to HSREN[n] setting</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Px.n output with ultra higher slew rate when HSREN[n] is 1</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>UHSREN12</name>
              <description>Port A-F Pin[n] Ultra High Slew Rate Control\nNote 2: Ultra higher slew rate function is used to match I3C and SPI application when releate pins are in 1.8V domain. Both UHSREN[n] and HSREN[n] need to be set to 1.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Px.n output with basic/higher slew rate according to HSREN[n] setting</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Px.n output with ultra higher slew rate when HSREN[n] is 1</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>UHSREN13</name>
              <description>Port A-F Pin[n] Ultra High Slew Rate Control\nNote 2: Ultra higher slew rate function is used to match I3C and SPI application when releate pins are in 1.8V domain. Both UHSREN[n] and HSREN[n] need to be set to 1.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Px.n output with basic/higher slew rate according to HSREN[n] setting</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Px.n output with ultra higher slew rate when HSREN[n] is 1</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>UHSREN14</name>
              <description>Port A-F Pin[n] Ultra High Slew Rate Control\nNote 2: Ultra higher slew rate function is used to match I3C and SPI application when releate pins are in 1.8V domain. Both UHSREN[n] and HSREN[n] need to be set to 1.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Px.n output with basic/higher slew rate according to HSREN[n] setting</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Px.n output with ultra higher slew rate when HSREN[n] is 1</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>UHSREN15</name>
              <description>Port A-F Pin[n] Ultra High Slew Rate Control\nNote 2: Ultra higher slew rate function is used to match I3C and SPI application when releate pins are in 1.8V domain. Both UHSREN[n] and HSREN[n] need to be set to 1.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Px.n output with basic/higher slew rate according to HSREN[n] setting</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Px.n output with ultra higher slew rate when HSREN[n] is 1</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
