cmsis-svd/cmsis-svd/data/Nuvoton/NUC1263AE.svd
       <register>
          <name>PDMA_REQSEL0_3</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PDMA_REQSEL0_3</displayName>
          <description>PDMA Channel 0 to Channel 3 Request Source Select Register</description>
          <addressOffset>0x480</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REQSRC0</name>
              <description>Channel 0 Request Source Selection\nThis filed defines which peripheral is connected to PDMA channel 0. User can configure the peripheral by setting REQSRC0.\nNote 1: A request source can't assign to two channels at the same time.\nNote 2: This field is useless when transfer between memory and memory.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Disable PDMA</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Reserved.</description>
                    <value>1</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>4</name>
                    <description>Channel connects to UART0_TX</description>
                    <value>4</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>5</name>
                    <description>Channel connects to UART0_RX</description>
                    <value>5</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>6</name>
                    <description>Channel connects to UART1_TX</description>
                    <value>6</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>7</name>
                    <description>Channel connects to UART1_RX</description>
                    <value>7</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>8</name>
                    <description>Channel connects to UART2_TX</description>
                    <value>8</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>9</name>
                    <description>Channel connects to UART2_RX</description>
                    <value>9</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>10</name>
                    <description>Channel connects to DAC_0 TX</description>
                    <value>10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>11</name>
                    <description>Channel connects to DAC_1 TX</description>
                    <value>11</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>12</name>
                    <description>Channel connects to DAC_2 TX</description>
                    <value>12</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>13</name>
                    <description>Channel connects to DAC_3 TX</description>
                    <value>13</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>14</name>
                    <description>Reserved.</description>
                    <value>14</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>15</name>
                    <description>Reserved.</description>
                    <value>15</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>16</name>
                    <description>Channel connects to SPI0_TX</description>
                    <value>16</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>17</name>
                    <description>Channel connects to SPI0_RX</description>
                    <value>17</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>18</name>
                    <description>Channel connects to SPI1_TX</description>
                    <value>18</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>19</name>
                    <description>Channel connects to SPI1_RX</description>
                    <value>19</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>20</name>
                    <description>Channel connects to ADC_RX</description>
                    <value>20</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>21</name>
                    <description>Reserved.</description>
                    <value>21</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>22</name>
                    <description>Channel connects to I3CS0_TX</description>
                    <value>22</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>23</name>
                    <description>Channel connects to I3CS0_RX</description>
                    <value>23</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>24</name>
                    <description>Channel connects to I3CS1_TX</description>
                    <value>24</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>25</name>
                    <description>Channel connects to I3CS1_RX</description>
                    <value>25</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>26</name>
                    <description>Reserved.</description>
                    <value>26</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>27</name>
                    <description>Reserved.</description>
                    <value>27</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>28</name>
                    <description>Channel connects to I2C0_TX</description>
                    <value>28</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>29</name>
                    <description>Channel connects to I2C0_RX</description>
                    <value>29</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>30</name>
                    <description>Channel connects to I2C1_TX</description>
                    <value>30</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>31</name>
                    <description>Channel connects to I2C1_RX</description>
                    <value>31</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>32</name>
                    <description>Channel connects to TMR0</description>
                    <value>32</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>33</name>
                    <description>Channel connects to TMR1</description>
                    <value>33</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>34</name>
                    <description>Channel connects to TMR2</description>
                    <value>34</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>35</name>
                    <description>Channel connects to TMR3</description>
                    <value>35</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>36</name>
                    <description>Channel connects to LLSI0</description>
                    <value>36</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>37</name>
                    <description>Channel connects to LLSI1</description>
                    <value>37</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>38</name>
                    <description>Channel connects to LLSI2</description>
                    <value>38</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>39</name>
                    <description>Channel connects to LLSI3</description>
                    <value>39</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>40</name>
                    <description>Channel connects to LLSI4</description>
                    <value>40</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>41</name>
                    <description>Channel connects to LLSI5</description>
                    <value>41</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>42</name>
                    <description>Reserved.</description>
                    <value>42</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>43</name>
                    <description>Reserved.</description>
                    <value>43</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>44</name>
                    <description>Reserved.</description>
                    <value>44</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>45</name>
                    <description>Reserved.</description>
                    <value>45</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>46</name>
                    <description>Channel connects to SPI2_TX</description>
                    <value>46</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>47</name>
                    <description>Channel connects to SPI2_RX</description>
                    <value>47</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>48</name>
                    <description>Channel connects to I2C2_TX</description>
                    <value>48</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>49</name>
                    <description>Channel connects to I2C2_RX</description>
                    <value>49</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>REQSRC1</name>
              <description>Channel 1 Request Source Selection\nThis filed defines which peripheral is connected to PDMA channel 1. User can configure the peripheral setting by REQSRC1. \nNote: The channel configuration is the same as REQSRC0 field. Please refer to the explanation of REQSRC0.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REQSRC2</name>
              <description>Channel 2 Request Source Selection\nThis filed defines which peripheral is connected to PDMA channel 2. User can configure the peripheral setting by REQSRC2. \nNote: The channel configuration is the same as REQSRC0 field. Please refer to the explanation of REQSRC0.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REQSRC3</name>
              <description>Channel 3 Request Source Selection\nThis filed defines which peripheral is connected to PDMA channel 3. User can configure the peripheral setting by REQSRC3. \nNote: The channel configuration is the same as REQSRC0 field. Please refer to the explanation of REQSRC0.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>PDMA_REQSEL4_7</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PDMA_REQSEL4_7</displayName>
          <description>PDMA Channel 4 to Channel 7 Request Source Select Register</description>
          <addressOffset>0x484</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REQSRC4</name>
              <description>Channel 4 Request Source Selection\nThis filed defines which peripheral is connected to PDMA channel 4. User can configure the peripheral setting by REQSRC4. \nNote: The channel configuration is the same as REQSRC0 field. Please refer to the explanation of REQSRC0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REQSRC5</name>
              <description>Channel 5 Request Source Selection\nThis filed defines which peripheral is connected to PDMA channel 5. User can configure the peripheral setting by REQSRC5. \nNote: The channel configuration is the same as REQSRC0 field. Please refer to the explanation of REQSRC0.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REQSRC6</name>
              <description>Channel 6 Request Source Selection\nThis filed defines which peripheral is connected to PDMA channel 6. User can configure the peripheral setting by REQSRC6. \nNote: The channel configuration is the same as REQSRC0 field. Please refer to the explanation of REQSRC0.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REQSRC7</name>
              <description>Channel 7 Request Source Selection\nThis filed defines which peripheral is connected to PDMA channel 7. User can configure the peripheral setting by REQSRC7. \nNote: The channel configuration is the same as REQSRC0 field. Please refer to the explanation of REQSRC0.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>PDMA_REQSEL8_9</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PDMA_REQSEL8_9</displayName>
          <description>PDMA Channel 8 to Channel 9 Request Source Select Register</description>
          <addressOffset>0x488</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REQSRC8</name>
              <description>Channel 8 Request Source Selection\nThis filed defines which peripheral is connected to PDMA channel 8. User can configure the peripheral setting by REQSRC8. \nNote: The channel configuration is the same as REQSRC0 field. Please refer to the explanation of REQSRC0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REQSRC9</name>
              <description>Channel 9 Request Source Selection\nThis filed defines which peripheral is connected to PDMA channel 9. User can configure the peripheral setting by REQSRC9. \nNote: The channel configuration is the same as REQSRC0 field. Please refer to the explanation of REQSRC0.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
