cmsis-svd/cmsis-svd/data/Nuvoton/NUC1263AE.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>I3CS0</name>
      <description>I3CS Register Map</description>
      <groupName>I3CS</groupName>
      <baseAddress>0x40070000</baseAddress>
      <!-- d -> no access permission -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xC</offset>
        <size>0xC</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1C</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x34</offset>
        <size>0x14</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4C</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x70</offset>
        <size>0x18</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x8C</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x94</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xD4</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
       <register>
          <name>I3CS_DEVCTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>I3CS_DEVCTL</displayName>
          <description>I3CS Device Control Register</description>
          <addressOffset>0x0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PENDINT</name>
              <description>Pending Interrupt Status\nThis field is used for setting the interrupt number and is also reflected in I3CS_CCCDEVS[3:0] PENDINT.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IDLECNT</name>
              <description>Idle Count Multiplier \nAfter power-on reset, the Slave controller is enabled only after it sees both SDA and SCL lines idle for a specified time. This idle time is calculated by multiplying IDLECNT with Bus Avaliable Time.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>1 Idle Count</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>2 Idle Counts</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>4 Idle Counts</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>8 Idle Counts</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNC</name>
              <description>Enable I3C Controller SYNC Flag (Read Only)</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Enables the I3C controller is completed</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Enables the I3C controller is ongoing</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>ADAPTIVE</name>
              <description>Adaptive Mode\nSetting of this bit is NOT required to put the controller in Adaptive Mode. It is only used to enable some features of the Slave controller to adapt to Adaptive I2C/I3C mode of operation. This bit is cleared automatically if the controller determines the mode as I3C. (Effect on Hot- Join) \nIf this bit is programmed to 1'b1, the controller initiates a Hot-Join request only after it has switched to I3C mode of operation. If this bit is not set, the controller initiates a Hot- Join without determining the bus mode assuming itself to be on i3c bus. This bit should be set only if the Slave application does not know to which bus the device is connected to.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Adptive mode is Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Adptive mode is Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DMAEN</name>
              <description>DMA Handshake Interface Enable </description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The DMA handshake control has no significance</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Enables the DMA handshake control to interact with external DMA</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>RESUME</name>
              <description>I3CS Resume Bit\nThis bit is used to resume the controller after it goes to the halt state.\nNote 1: This bit is cleared by writing 1 to it.\nNote 2: In the Slave mode of operation, the controller goes to the halt state due to following conditions:\nAny type of error in the transfer \nMRL Register (I3CS_SLVMXLEN[31:16]) updated by the master through SETMRL CCC.\nNote 3: After the controller goes to the halt state, the application has to take necessary action to handle the error condition and then write 1'b1 to this bit to resume the controller. This bit is auto-cleared once the controller is ready to accept new transfers.RESUME cannot be auto cleared until GETSTATS CCC is received if Slave has Protocol Error.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>RESUME operation is completion</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>RESUME operation is in progress</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Controls whether I3CS is enabled\nThis bit is used to disable or enable the I3CS cntroller.\nNote: User can read I3C_DEVCTL[26] SYNC bit to monitor enable/disable I3C is completion ot not.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>I3CS controller Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>I3CS controller Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>I3CS_DEVADDR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>I3CS_DEVADDR</displayName>
          <description>I3CS Device Address Register</description>
          <addressOffset>0x4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00008000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SA</name>
              <description>Device Static Address\nThe I2C static address is used to respond to SETDASA CCC Command to get the Dynamic Address or performs Legacy I2C Read/Write operation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAVALID</name>
              <description>Static Address Valid\nThis bit reflects whether the I2C static address is valid in I2C slave mode. </description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Static Address is invalid</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Static Address is valid</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DA</name>
              <description>Device Dynamic Address (Read Only)\nThis field is used to indicate the device Dynamic Address after slave completes the dynamic address assignment operation by ENTDAA, SETDASA or SETNEDA CCC.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DAVALID</name>
              <description>Dynamic Address Valid \nIn I3C Slave mode, the Controller sets this bit to 1 when Main Master assigns the Dynamic address during ENTDAA or SETDASA mechanism.\nNote: This bit can be auto cleared to 0 if RSTDAA CCC is received.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Dynamic Address is invalid</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Dynamic Address is valid</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>I3CS_CMDQUE</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>I3CS_CMDQUE</displayName>
          <description>I3CS Command Queue Port Register</description>
          <addressOffset>0xC</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CMDATTR</name>
              <description>Command Attribute\nDefines the command attribute and its field format.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Transmit Command without IBI</description>
                    <value>0</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>write-only</access>
            </field>
            <field>
              <name>TID</name>
              <description>Transmit Transaction ID \nThis field is used as the identification tag for the command.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DATLEN</name>
              <description>Data Length\nThis field is used to indicate the data length in bytes of the master read transfer.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>I3CS_RESPQUE</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>I3CS_RESPQUE</displayName>
          <description>I3CS Response Queue Port Register</description>
          <addressOffset>0x10</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATLEN</name>
              <description>Data Length\nData Length in bytes of Master Write Transfer or the Remaining Length of Master Read Transfer (Master termination or Slave underrun).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HDRCODE</name>
              <description>HDR Command Code</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>SDR Transfer</description>
                    <value>00</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>TID</name>
              <description>Transmit Transaction ID\nThis field is used as the identification tag for the transmit command.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXRESP</name>
              <description>Transaction Type\nThis field is used to identify the type of transaction.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Transmit Response occurred</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Receive Response occurred</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>ERRSTS</name>
              <description>Error Status</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No Error</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>CRC error (master write in DDR mode)</description>
                    <value>1</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Parity error (master write in both DDR and SDR mode)</description>
                    <value>2</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Frame error (HDR mode master write)</description>
                    <value>3</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>6</name>
                    <description>Underflow/Overflow error</description>
                    <value>6</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>10</name>
                    <description>Master early termination</description>
                    <value>10</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>I3CS_TXRXDAT</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>I3CS_TXRXDAT</displayName>
          <description>I3CS Transmit and Receive Data Port Register</description>
          <addressOffset>0x14</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAT</name>
              <description>Transmit and Receive Data Port\nTransmit (Write) Operation:\nThe Transmit Data port is mapped to the Tx-Data Buffer. The transmit data should always be packed as 4-byte aligned data words and written to the Transmit Data Port register. If the Command length is not aligned to 4-bytes, then the additional bytes are ignored.\nReceive (Read) Operation:\nThe Receive Data port is mapped to the Rx-Data Buffer. The Receive data is always packed in 4-byte aligned data words and stored in the Rx-Data Buffer. If the command length is not aligned to the 4-bytes, then the additional data bytes have to be ignored.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>I3CS_QUETHCTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>I3CS_QUETHCTL</displayName>
          <description>I3CS Queue Threshold Control Register</description>
          <addressOffset>0x1C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000101</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CMDETH</name>
              <description>Command Buffer Empty Threshold Value\nControls the number of empty locations (or greater) in the Command Queue that trigger the Command Queue Ready interrupt (CMDRDY). \nThe valid range is 0 to 3. The software programs only valid values. Value of N ranging from 1 to 3 sets the threshold to N empty locations and a value of 0 sets the threshold to indicate that the queue is completely empty.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESPTH</name>
              <description>Response Buffer Threshold Value\nControls the number of entries (or greater) in the ResponseQueue that trigger the Response Queue Ready interrupt (RESPRDY).\nThe valid range is 0 to 1. The software programs only valid values. A value of 0 sets the threshold for 1 entry, and a value of N sets the threshold for N+1 entries.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
