cmsis-svd/cmsis-svd/data/Nuvoton/NUC1263AE.svd
       <register>
          <name>I3CS_SLVCHAR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>I3CS_SLVCHAR</displayName>
          <description>I3CS Slave Characteristic Register</description>
          <addressOffset>0x78</addressOffset>
          <access>read-write</access>
          <resetValue>0x00010026</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MXDSLIM</name>
              <description>Max Data Speed Limitation field in Bus Characteristic Register\nThe value of this field is indicating the BCR[0] value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No limitation</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Limitation</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>IBICAP</name>
              <description>IBI Request Capable Field in Bus Characteristic Register (Read Only)\nThe value of this field is fixed at 1 (BCR[1]), indicating Support IBI generation.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IBIPL</name>
              <description>IBI Payload Field in Bus Characteristic Register (Read Only)\nThe value of this field is fixed at 1 (BCR[2]), indicating Support IBI payload.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OLCAP</name>
              <description>Offline Capable Field in Bus Characteristic Register (Read Only)\nThe value of this field is fixed at 0 (BCR[3]), indicating Slave will always respond to I3C bus commands.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BRIDGEID</name>
              <description>Bridge Identifier Field in Bus Characteristic Register (Read Only)\nThe value of this field is fixed at 0 (BCR[4]), indicating Not a bridge device.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HDRCAP</name>
              <description>SDR Only or SDR and HDR Capable field in Bus Characteristic Register\nThe value of this field is indicating the BCR[5] value.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>SDR only</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>HDR capable</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DEVROLE</name>
              <description>Device Role Field in Bus Characteristic Register (Read Only)\nThe value of this field is fixed at 0 (BCR[7:6]), indicating I3C Slave.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DCR</name>
              <description>I3C Device Characteristic Value\nThe value of this field can be set as Device Characteristic Value.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HDRCPVAL</name>
              <description>I3C Device HDR Capability Register Value (Read Only)\nThe value of this field is fixed at 1, indicating HDR-DDR.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>I3CS_SLVMXLEN</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>I3CS_SLVMXLEN</displayName>
          <description>I3CS Maximum Write/Read Length Register</description>
          <addressOffset>0x7C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MWL</name>
              <description>I3C Device Max Write Length\nThis field will be updated if SETMWL CCC is received.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MRL</name>
              <description>I3C Device Max Read Length\nThis field will be updated if SETMRL CCC is received.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>I3CS_MXRDTURN</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>I3CS_MXRDTURN</displayName>
          <description>I3CS Maximum Read Turnaround Time Register</description>
          <addressOffset>0x80</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MXRDTURN</name>
              <description>Specifies the Maximum Read Tturnaround Time (Read Only)\nThe 3rd byte which returned in the GETMXDS CCC (in microseconds (us))</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>I3CS_MXDS</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>I3CS_MXDS</displayName>
          <description>I3CS Maximum Data Speed Register</description>
          <addressOffset>0x84</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MXWR</name>
              <description>Specifies the Maximum Sustained Data Rate for Non-CCC Messages Sent by Master Device to Slave device  \nThe 1st byte which returned in the GETMXDS CCC.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>12.5 MHz</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>8 MHz</description>
                    <value>1</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>6 MHz</description>
                    <value>2</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>4 MHz</description>
                    <value>3</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>4</name>
                    <description>2 MHz</description>
                    <value>4</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>MXRD</name>
              <description>Specifies the Maximum Sustained Data Rate for Non-CCC Messages Sent by Slave Device to Master Device  \nThe 2nd byte which returned in the GETMXDS CCC.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>12.5 MHz</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>8 MHz</description>
                    <value>1</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>6 MHz</description>
                    <value>2</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>4 MHz</description>
                    <value>3</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>4</name>
                    <description>2 MHz</description>
                    <value>4</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>MXDTURN</name>
              <description>Specifies the Clock to Data Turnaround Time</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>8 ns</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>9 ns</description>
                    <value>1</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>10 ns</description>
                    <value>2</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>11 ns</description>
                    <value>3</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>4</name>
                    <description>12 ns</description>
                    <value>4</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>I3CS_SIR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>I3CS_SIR</displayName>
          <description>I3CS Slave Interrupt Request Register</description>
          <addressOffset>0x8C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EN</name>
              <description>Slave Interrupt Request\nWhen set, the slave controller attempts to issue the SIR on the I3C bus. Once issued and when the current master accepts (ACK) or if the controller is unable to issue the SIR, then the controller clears this bit automatically and updates the I3CS_SIRRESP[2:0] IBISTS. If the NACK response is received for the SIR, the controller reattempts the SIR upon detecting the next START condition from the master or after the Bus Available Time. Once set, the application cannot clear this bit.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTL</name>
              <description>Slave Interrupt Request Control</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Indicates source of SIR data to be from the registers</description>
                    <value>#00</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>MDB</name>
              <description>Mandatory Data Byte\nThis field gives the mandatory data byte which is required to be transmitted after the Master ACK the slave address during SIR transfer. This field is only applicable when I3C_SLVCHAR[2] IBIPL (BCR[2]) is set indicating that SIR supports payload data.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATLEN</name>
              <description>Slave Interrupt Request Data Length \nThis field should be programmed by the slave application to give the data length for the payload data other than the MDB byte. This field is only applicable when BCR[2] is set indicating that SIR supports payload data.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>I3CS_SIRDAT</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>I3CS_SIRDAT</displayName>
          <description>I3CS Slave Interrupt Request Data Register</description>
          <addressOffset>0x94</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAT0</name>
              <description>SIR Data Byte 0 \nThis register SIRDAT containing four bytes of SIR Data will be in effect only when CTL field in I3CS_SIR register is programmed to 00 provided the data length is up to 1.\nThis field holds the first byte of SIR DATA that will be passed after the MDB when SIR is initiated by the application on writing into EN bit in I3CS_SIR register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAT1</name>
              <description>SIR Data Byte 1 \nThis register SIRDAT containing four bytes of SIR Data will be in effect only when CTL field in I3CS_SIR register is register programmed to 00 provided the data length is up to 2.\nThis field holds the second byte of SIR DATA that will be passed after the MDB when SIR is initiated by the application on writing into EN bit in I3CS_SIR register.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAT2</name>
              <description>SIR Data Byte 2 \nThis register SIRDAT containing four bytes of SIR Data will be in effect only when CTL field in I3CS_SIR register   is programmed to 00 provided the data length is up to 3.\nThis field holds the third byte of SIR DATA that will be passed after the MDB when SIR is initiated by the application on writing into EN bit in I3CS_SIR register.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAT3</name>
              <description>SIR Data Byte 3 \nThis register SIRDAT containing four bytes of SIR Data will be in effect only when CTL field in I3CS_SIR register is programmed to 00 provided the data length is up to 4.\nThis field holds the fourth byte of SIR DATA that will be passed after the MDB when SIR is initiated by the application on writing into EN bit in I3CS_SIR register.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>I3CS_SIRRESP</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>I3CS_SIRRESP</displayName>
          <description>I3CS Slave Interrupt Request Response Register</description>
          <addressOffset>0x98</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IBISTS</name>
              <description>IBI Completion Status\nThis field is common for SIR\nThe controller does not attempt to issue the IBI and generates the IBI Completion Status as 3'b011 if one of the following condition is true.\nMaster has not assigned the Dynamic Address.\nMaster has cleared the assigned Dynamic Address (through RSTDAA CCC).\nMaster has disabled the IBI event (through DISEC CCC).\nThe controller has switched the role to Master (applicable only for secondary master configuration).\nDATLEN doesn't match with I3CS_SIR[23:16].</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Reserved.</description>
                    <value>#000</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>IBI accepted by the Master (ACK response received)</description>
                    <value>#001</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Master Early Terminate (only for SIR with Data)</description>
                    <value>#010</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>IBI Not Attempted</description>
                    <value>#011</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DATLEN</name>
              <description>Data Length for SIR Response\nThe value in this filed will indicate the number of bytes remaining that was not transmitted because of Master early terminating the SIR transfer.\nIn case the IBI is not attempted the number for bytes returned will be same as that programmed for IBI payload</description>
              <bitOffset>8</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>I3CS_BUSFAT</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>I3CS_BUSFAT</displayName>
          <description>I3CS Bus Free and Available Timing Register</description>
          <addressOffset>0xD4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00200000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AVAILTC</name>
              <description>Bus Avaliable Time Count Value\nThis register field is used only in Slave mode of operation Bus Available Count Value . This field is used by the Slaveto initiate an IBI after STOP condition.\nNote: IBI event can be generated after bus available time expires.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>I3CS_BUSIDLET</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>I3CS_BUSIDLET</displayName>
          <description>I3CS Bus Idle Timing Register</description>
          <addressOffset>0xD8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000020</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IDLETC</name>
              <description>Bus Idle Time Count Value\nThis field is used by the controller in Slave mode to initiate Hot-Join request if the dynamic address is not valid.\nNote: Hot-Join event can be generated after bus idle time expires.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
