cmsis-svd/cmsis-svd/data/Nuvoton/NUC1263AE.svd
       <register>
          <name>I3CS_DBTHCTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>I3CS_DBTHCTL</displayName>
          <description>I3CS Data Buffer Threshold Control Register</description>
          <addressOffset>0x20</addressOffset>
          <access>read-write</access>
          <resetValue>0x01010101</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXTH</name>
              <description>Transmit Buffer Threshold Value\nThe supported values for TXTH are</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>1</description>
                    <value>#000</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>4</description>
                    <value>#001</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>8</description>
                    <value>#010</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>16</description>
                    <value>#011</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>RXTH</name>
              <description>Receive Buffer Threshold Value\nThe supported values for RXTH are</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>1</description>
                    <value>#000</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>4</description>
                    <value>#001</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>8</description>
                    <value>#010</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>16</description>
                    <value>#011</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>TXSTATH</name>
              <description>Transfer Start Threshold Value \nIn slave mode of operation the slave controller ACK's a read request from Master only if either one of the following conditions are met:\n1. Data length (as specified in the command) number of locations are filled in the Transmit FIFO\n2. Threshold number of entries (or more) are available in the Transmit FIFO\nThe supported values for RXSTATH are:</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>1</description>
                    <value>#000</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>4</description>
                    <value>#001</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>8</description>
                    <value>#010</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>16</description>
                    <value>#011</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>RXSTATH</name>
              <description>Receive Start Threshold Value \nIn the slave mode of operation the slave controller ACK's a write request from Master only if threshold number of empty locations(or more) are available in its receive buffer.\nThe supported values for RXSTATH are:</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>1</description>
                    <value>#000</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>4</description>
                    <value>#001</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>8</description>
                    <value>#010</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>16</description>
                    <value>#011</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>I3CS_RSTCTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>I3CS_RSTCTL</displayName>
          <description>I3CS Reset Control Register</description>
          <addressOffset>0x34</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWRST</name>
              <description>Core Software Reset\nWrite 1'b1 to this bit to exercise software reset.\nThis resets all Buffers - Receive, Transmit and Queues - Command, and Response.\nThis bit is cleared automatically once the core reset is completed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMDRST</name>
              <description>Command Queue Software Reset\nWrite 1'b1 to this bit to exercise Command Queue reset. \nThis bit is cleared automatically once the Command Queue reset is completed.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESPRST</name>
              <description>Response Queue Software Reset\nWrite 1'b1 to this bit to exercise Response Queue reset. \nThis bit is cleared automatically once the Response Queue reset is completed.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXRST</name>
              <description>Transmit Buffer Software Reset\nWrite 1'b1 to this bit to exercise Transmit Buffer reset. \nThis bit is cleared automatically once the Transmit Buffer reset is completed.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXRST</name>
              <description>Receive Buffer Software Reset\nWrite 1'b1 to this bit to exercise Receive Buffer reset. \nThis bit is cleared automatically once the Receive buffer reset is completed.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>I3CS_SLVEVNTS</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>I3CS_SLVEVNTS</displayName>
          <description>I3CS Slave Event Status Register</description>
          <addressOffset>0x38</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000009</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SIREN</name>
              <description>Slave Interrupt Request Enable Bit (Read Only)\nIn Slave mode of operation, this bit reflects whether the controller can initiate the SIR on the I3C bus or not. Usually, this bit is set or cleared by the I3C Master through ENEC or DISEC CCC.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HJEN</name>
              <description>Hot-Join Interrupt Enable Bit (Read Only)\nThis bit reflects whether the Hot-Join Request Interrupts are allowed on the I3C bus or not. The Slave application can choose to Disable HJ Capability of the SLave Controller (if selected) by setting this field to 0 before 'Enabling' the Controller. When done so, the Slave does not initiate Hot Join and takes part in Address Assignment without initiating Hot Join. If this field is NOT set to 0 by slave application, it can be set or cleared by the I3C Master through ENEC or DISEC CCCs. Once Disabled by software, CCCs do not have any effect on this field.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ACTSTATE</name>
              <description>Activity State Status (Read Only)\nThis bit reflects the Activity State of slave set by the Master.\nENTAS0 - 00\nENTAS1 - 01\nENTAS2 - 10\nENTAS3 - 11</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MRLUPD</name>
              <description>MRL Updated Status\nThis bit indicates a SETMRL CCC is received by the slave. The updated MRL value can be read from I3CS_SLVMXLEN register. \nNote: This bit is cleared by writing 1 to it.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MWLUPD</name>
              <description>MWL Updated Status\nThis bit indicates a SETMWL CCC is received by the slave. The updated MWL value can be read from I3CS_SLVMXLEN register. \nNote: This bit is cleared by writing 1 to it.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>I3CS_INTSTS</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>I3CS_INTSTS</displayName>
          <description>I3CS Interrupt Status Register</description>
          <addressOffset>0x3C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXTH</name>
              <description>Transmit Buffer Threshold Status (Read Only)\nThis interrupt is generated when the number of empty locations in transmit buffer is greater than or equal to threshold value specified by TXTH field in DBTHCTL register. This interrupt is cleared automatically when number of empty locations in transmit buffer is less than threshold value specified.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXTH</name>
              <description>Receive Buffer Threshold Status (Read Only)\nThis interrupt is generated when number of entries in receive buffer is greater than or equal to threshold value specified by RXTH field in DBTHCTL register. This interrupt is cleared automatically when number of entries in receive buffer is less than threshold value specified.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CMDRDY</name>
              <description>Command Queue Ready Status (Read Only)\nThis interrupt is generated when number of empty locations in command queue is greater than or equal to threshold value specified by CMDETH field in QUETHCTL register. This interrupt is cleared automatically when number of empty locations in command buffer is less than threshold value specified.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RESPRDY</name>
              <description>Response Queue Ready Status (Read Only)\nThis interrupt is generated when number of entries in response queue is greater than or equal to threshold valuespecified by RESPTH field in QUETHCTL register. This interrupt is cleared automatically when number of entries in response buffer is less than threshold value specified.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CCCUPD</name>
              <description>CCC Table Updated Status\nThis interrupt is generated if any of the CCC registers are updated by I3C Master through CCC commands.\nNote: This bit is cleared by writing 1 to it.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAA</name>
              <description>Dynamic Address Assigned Status\nThis interrupt is generated if the device's Dynamic Address is assigned through SETDASA or ENTDAA CCC.\nNote: This bit is cleared by writing 1 to it.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TFRERR</name>
              <description>Transfer Error Status\nThis interrupt is generated if any error occurs during transfer. The error type is specified in the error status field of resopnse queue.\nNote: This bit is cleared by writing 1 to it.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READREQ</name>
              <description>Read Request Received\nRead Request received from the current master when CMDQ is empty.\nNote: This bit is cleared by writing 1 to it.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IBIUPD</name>
              <description>IBI Status Updated\nIt indicates that the IBI request initiated through SIR request register is addressed and status is updated.\nNote: This bit is cleared by writing 1 to it.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>I3CS_INTSTSEN</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>I3CS_INTSTSEN</displayName>
          <description>I3CS Interrupt Status Enable Register</description>
          <addressOffset>0x40</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXTH</name>
              <description>Transmit Buffer Threshold Status Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>TX buffer threshold interrupt status Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>TX buffer threshold interrupt status Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>RXTH</name>
              <description>Receive Buffer Threshold Status Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>RX buffer threshold interrupt status Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>RX buffer threshold interrupt status Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CMDRDY</name>
              <description>Command Queue Ready Status Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Command queue ready interrupt status Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Command queue ready interrupt status Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>RESPRDY</name>
              <description>Response Queue Ready Status Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Response queue ready interrupt status Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Response queue ready interrupt status Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CCCUPD</name>
              <description>CCC Table Updated Status Enable Bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>CCC updated interrupt status Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>CCC updated interrupt status Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DAA</name>
              <description>Dynamic Address Assigned Status Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>DAA interrupt status Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>DAA interrupt status Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>TFRERR</name>
              <description>Transfer Error Status Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Transfer error interrupt status Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Transfer error interrupt status Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>READREQ</name>
              <description>Read Request Received Status Enable </description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Read request received interrupt status Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Read request received interrupt status Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>IBIUPD</name>
              <description>IBI Updated Status Enable Bit</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>IBI interrupt status Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>IBI interrupt status Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
