cmsis-svd/cmsis-svd/data/Nuvoton/NUC1263AE.svd
       <register derivedFrom="USBD_MXPLD0">
          <name>USBD_MXPLD7</name>
          <displayName>USBD_MXPLD7</displayName>
          <description>Endpoint 7 Maximal Payload Register</description>
          <addressOffset>0x574</addressOffset>
       </register>
       <register derivedFrom="USBD_CFG0">
          <name>USBD_CFG7</name>
          <displayName>USBD_CFG7</displayName>
          <description>Endpoint 7 Configuration Register</description>
          <addressOffset>0x578</addressOffset>
       </register>
       <register derivedFrom="USBD_CFGP0">
          <name>USBD_CFGP7</name>
          <displayName>USBD_CFGP7</displayName>
          <description>Endpoint 7 Set Stall and Clear In/Out Ready Control Register</description>
          <addressOffset>0x57C</addressOffset>
       </register>
       <register derivedFrom="USBD_BUFSEG0">
          <name>USBD_BUFSEG8</name>
          <displayName>USBD_BUFSEG8</displayName>
          <description>Endpoint 8 Buffer Segmentation Register</description>
          <addressOffset>0x580</addressOffset>
       </register>
       <register derivedFrom="USBD_MXPLD0">
          <name>USBD_MXPLD8</name>
          <displayName>USBD_MXPLD8</displayName>
          <description>Endpoint 8 Maximal Payload Register</description>
          <addressOffset>0x584</addressOffset>
       </register>
       <register derivedFrom="USBD_CFG0">
          <name>USBD_CFG8</name>
          <displayName>USBD_CFG8</displayName>
          <description>Endpoint 8 Configuration Register</description>
          <addressOffset>0x588</addressOffset>
       </register>
       <register derivedFrom="USBD_CFGP0">
          <name>USBD_CFGP8</name>
          <displayName>USBD_CFGP8</displayName>
          <description>Endpoint 8 Set Stall and Clear In/Out Ready Control Register</description>
          <addressOffset>0x58C</addressOffset>
       </register>
       <register derivedFrom="USBD_BUFSEG0">
          <name>USBD_BUFSEG9</name>
          <displayName>USBD_BUFSEG9</displayName>
          <description>Endpoint 9 Buffer Segmentation Register</description>
          <addressOffset>0x590</addressOffset>
       </register>
       <register derivedFrom="USBD_MXPLD0">
          <name>USBD_MXPLD9</name>
          <displayName>USBD_MXPLD9</displayName>
          <description>Endpoint 9 Maximal Payload Register</description>
          <addressOffset>0x594</addressOffset>
       </register>
       <register derivedFrom="USBD_CFG0">
          <name>USBD_CFG9</name>
          <displayName>USBD_CFG9</displayName>
          <description>Endpoint 9 Configuration Register</description>
          <addressOffset>0x598</addressOffset>
       </register>
       <register derivedFrom="USBD_CFGP0">
          <name>USBD_CFGP9</name>
          <displayName>USBD_CFGP9</displayName>
          <description>Endpoint 9 Set Stall and Clear In/Out Ready Control Register</description>
          <addressOffset>0x59C</addressOffset>
       </register>
       <register derivedFrom="USBD_BUFSEG0">
          <name>USBD_BUFSEG10</name>
          <displayName>USBD_BUFSEG10</displayName>
          <description>Endpoint 10 Buffer Segmentation Register</description>
          <addressOffset>0x5A0</addressOffset>
       </register>
       <register derivedFrom="USBD_MXPLD0">
          <name>USBD_MXPLD10</name>
          <displayName>USBD_MXPLD10</displayName>
          <description>Endpoint 10 Maximal Payload Register</description>
          <addressOffset>0x5A4</addressOffset>
       </register>
       <register derivedFrom="USBD_CFG0">
          <name>USBD_CFG10</name>
          <displayName>USBD_CFG10</displayName>
          <description>Endpoint 10 Configuration Register</description>
          <addressOffset>0x5A8</addressOffset>
       </register>
       <register derivedFrom="USBD_CFGP0">
          <name>USBD_CFGP10</name>
          <displayName>USBD_CFGP10</displayName>
          <description>Endpoint 10 Set Stall and Clear In/Out Ready Control Register</description>
          <addressOffset>0x5AC</addressOffset>
       </register>
       <register derivedFrom="USBD_BUFSEG0">
          <name>USBD_BUFSEG11</name>
          <displayName>USBD_BUFSEG11</displayName>
          <description>Endpoint 11 Buffer Segmentation Register</description>
          <addressOffset>0x5B0</addressOffset>
       </register>
       <register derivedFrom="USBD_MXPLD0">
          <name>USBD_MXPLD11</name>
          <displayName>USBD_MXPLD11</displayName>
          <description>Endpoint 11 Maximal Payload Register</description>
          <addressOffset>0x5B4</addressOffset>
       </register>
       <register derivedFrom="USBD_CFG0">
          <name>USBD_CFG11</name>
          <displayName>USBD_CFG11</displayName>
          <description>Endpoint 11 Configuration Register</description>
          <addressOffset>0x5B8</addressOffset>
       </register>
       <register derivedFrom="USBD_CFGP0">
          <name>USBD_CFGP11</name>
          <displayName>USBD_CFGP11</displayName>
          <description>Endpoint 11 Set Stall and Clear In/Out Ready Control Register</description>
          <addressOffset>0x5BC</addressOffset>
       </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>CRC</name>
      <description>CRC Register Map</description>
      <groupName>CRC</groupName>
      <baseAddress>0x50018000</baseAddress>
      <!-- d -> no access permission -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
       <register>
          <name>CRC_CTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRC_CTL</displayName>
          <description>CRC Control Register</description>
          <addressOffset>0x0</addressOffset>
          <access>read-write</access>
          <resetValue>0x20000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CRCEN</name>
              <description>CRC Generator Enable Bit\nSet this bit 1 to enable CRC generator for CRC operation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No effect</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>CRC generator is active</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CHKSINIT</name>
              <description>Checksum Initialization\nSet this bit will auto reload SEED (CRC_SEED [31:0]) to CHECKSUM (CRC_CHECKSUM[31:0]) as CRC operation initial value.\nNote: This bit will be cleared automatically.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No effect</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Reload SEED value to CHECKSUM as CRC operation initial value</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DATREV</name>
              <description>Write Data Bit Order Reverse Enable Bit\nThis bit is used to enable the bit order reverse function per byte for write data value DATA (CRC_DATA[31:0]).\nNote: If the write data is 0xAABBCCDD, the bit order reverse for CRC write data in is 0x55DD33BB.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Bit order reversed for CRC DATA Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Bit order reversed for CRC DATA Enabled (per byte)</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CHKSREV</name>
              <description>Checksum Bit Order Reverse Enable Bit\nThis bit is used to enable the bit order reverse function for checksum result CHECKSUM (CRC_CHECKSUM[31:0]).\nNote: If the checksum result is 0xDD7B0F2E, the bit order reverse result for CRC checksum is 0x74F0DEBB.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Bit order reverse for CRC CHECKSUM Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Bit order reverse for CRC CHECKSUM Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DATFMT</name>
              <description>Write Data 1's Complement Enable Bit\nThis bit is used to enable the 1's complement function for write data value DATA (CRC_DATA[31:0]).</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>1's complement for CRC DATA Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>1's complement for CRC DATA Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CHKSFMT</name>
              <description>Checksum 1's Complement Enable Bit\nThis bit is used to enable the 1's complement function for checksum result CHECKSUM (CRC_CHECKSUM[31:0]).</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>1's complement for CRC CHECKSUM Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>1's complement for CRC CHECKSUM Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DATLEN</name>
              <description>CPU Write Data Length\nThis field indicates the valid write data length of DATA (CRC_DAT[31:0]).\nNote: When the write data length is 8-bit mode, the valid data in CRC_DAT register is only DATA[7:0] bits; if the write data length is 16-bit mode, the valid data in CRC_DAT register is only DATA[15:0].</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Data length is 8-bit mode</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Data length is 16-bit mode.\nData length is 32-bit mode</description>
                    <value>#01</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CRCMODE</name>
              <description>CRC Polynomial Mode\nThis field indicates the CRC operation polynomial mode. </description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>CRC-CCITT Polynomial mode</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>CRC-8 Polynomial mode</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>CRC-16 Polynomial mode</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>CRC-32 Polynomial mode</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRC_DAT</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRC_DAT</displayName>
          <description>CRC Write Data Register</description>
          <addressOffset>0x4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA</name>
              <description>CRC Write Data Bits\nUser can write data directly by CPU mode or use PDMA function to write data to this field to perform CRC operation.\nNote: When the write data length is 8-bit mode, the valid data in CRC_DAT register is only DATA[7:0] bits; if the write data length is 16-bit mode, the valid data in CRC_DAT register is only DATA[15:0].</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRC_SEED</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRC_SEED</displayName>
          <description>CRC Seed Register</description>
          <addressOffset>0x8</addressOffset>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEED</name>
              <description>CRC Seed Value\nThis field indicates the CRC seed value.\nNote 1: This SEED value will be loaded to checksum initial value CHECKSUM (CRC_CHECKSUM[31:0]) after set CHKSINIT (CRC_CTL[1]) to 1.\nNote 2: The valid bits of CRC_SEED[31:0] are correlated to CRCMODE (CRC_CTL[31:30]).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRC_CHECKSUM</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRC_CHECKSUM</displayName>
          <description>CRC Checksum Register</description>
          <addressOffset>0xC</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CHECKSUM</name>
              <description>CRC Checksum Results\nThis field indicates the CRC checksum result.\nNote: The valid bits of CRC_CHECKSUM[31:0] are correlated to CRCMODE (CRC_CTL[31:30]).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
